In [1]:
import numpy as np
import pandas as pd

### Dataframe

In [45]:
dict1 = {
    "Name" : ['Tom', 'Jack', 'Steve', 'Ricky'],
    "Age" : [28,34,29,42]
}

In [46]:
df1 = pd.DataFrame(dict1)
df1

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [47]:
df2 = pd.DataFrame(dict1,index=[1,2,3,4])

In [48]:
df2

    Name  Age
1    Tom   28
2   Jack   34
3  Steve   29
4  Ricky   42

In [49]:
df2['Age']

1    28
2    34
3    29
4    42
Name: Age, dtype: int64

In [50]:
df2['Marks'] = pd.DataFrame({"Marks":[19,34,65,37,88]})

In [51]:
df2

    Name  Age  Marks
1    Tom   28     34
2   Jack   34     65
3  Steve   29     37
4  Ricky   42     88

In [53]:
dfAppend = pd.DataFrame([["aaa",382,888]],columns=["Name","Age","Marks"])
df2.append(dfAppend)

/tmp/ipykernel_8012/2549560545.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df2.append(dfAppend)

    Name  Age  Marks
1    Tom   28     34
2   Jack   34     65
3  Steve   29     37
4  Ricky   42     88
0    aaa  382    888

In [54]:
df2[2:4]

    Name  Age  Marks
3  Steve   29     37
4  Ricky   42     88

In [55]:
df3 = df2.copy()

In [56]:
df3

    Name  Age  Marks
1    Tom   28     34
2   Jack   34     65
3  Steve   29     37
4  Ricky   42     88

In [57]:
df3.drop(columns=["Name"],axis=1)

   Age  Marks
1   28     34
2   34     65
3   29     37
4   42     88

In [40]:
df2.iloc[2]

Name     Steve
Age         29
Marks       37
Name: 3, dtype: object